Revit 2027 API
FabricationPart.ServiceAbbreviation Property
 The associated service abbreviation for the fabrication service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ServiceAbbreviation { get; }
Public ReadOnly Property ServiceAbbreviation As String
	Get
public:
property String^ ServiceAbbreviation {
	String^ get ();
}
member ServiceAbbreviation : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace